In [18]:
import pandas as pd
Location = "datasets/all_040_in_12.P1.csv"
df = pd.read_csv(Location)

df.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,12,40,12,NaN,NaN,NaN,NaN,NaN,Florida,18801310,8989580,15982378,7302947,18801310,15982378